Config/Documents/ЗакрытиеГода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗакрытиеГода</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинансовыйГод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменениеТипаУчреждения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокКодовСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗакрываемыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет40130</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС40130</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК40130</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗавершениеСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДебет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокКредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС40130</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФР</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФРСубконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФРСубконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФРСубконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/НастройкиИспользованияРПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИспользованияРПС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтруктураРПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурыРПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Enums/ВидыМежотчетногоПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыМежотчетногоПериода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаключениеСчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехнологическиеОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеВалютыБаланса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлужебныеОперации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ЗакрытиеГода/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ФинансовыйГод = ?(ЗначениеЗаполнено(Объект.Дата), НачалоГода(Объект.Дата) - 1 , НачалоГода(ТекущаяДатаСеанса()) - 1);
		
		Элементы.ГруппаДанные.ТекущаяСтраница = Элементы.ГруппаНовая;
		
		Объект.ЗакрываемыеСчета.Очистить();
					
	ИначеЕсли Объект.ЗакрываемыеСчета.Количество() > 0 Тогда
		
		Элементы.ГруппаДанные.ТекущаяСтраница = Элементы.ГруппаУстарело;
		Элементы.СписокСчетов.Видимость = Ложь;
		
	Иначе
		
		Элементы.ГруппаДанные.ТекущаяСтраница = Элементы.ГруппаНовая;
		
	КонецЕсли;
	
	МассивВыбранных =  СтрРазделить(Объект.СписокКодовСчетов, ",", Ложь);
	
	МассивВсех =  СтрРазделить("210.02,210.82,210.92,210.04,304.04,304.66,304.76,304.84,304.94,304.86,304.96,304.05,304.06,401.10,401.16,401.17,401.18,401.19,401.20,401.26,401.27,401.28,401.29", ",", Ложь);
	
	Для Каждого КодСчета Из МассивВсех Цикл
		СписокСчетов.Добавить(КодСчета, КодСчета, МассивВыбранных.Количество() = 0 ИЛИ НЕ МассивВыбранных.Найти(КодСчета) = Неопределено); 
	КонецЦикла;	
	
	ФинансовыйГодПрежняя = ТекстФинансовыйГод;
	
	Элементы.ТекстФинансовыйГод.Видимость = НЕ Объект.ИзменениеТипаУчреждения;
	Элементы.ФинансовыйГод.Видимость = Объект.ИзменениеТипаУчреждения;
	
	СчетаФинРезультата = БухгалтерскийУчет.СписокСчетов("401.30");
	СчетФинРезультата = ?(СчетаФинРезультата.Количество() = 1, СчетаФинРезультата[0], ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НастройкиИспользованияРПС.ИФО КАК ИФО
		|ИЗ
		|	РегистрСведений.НастройкиИспользованияРПС КАК НастройкиИспользованияРПС
		|ГДЕ
		|	НЕ НастройкиИспользованияРПС.ИФО = ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)");
		
		Результат = Запрос.Выполнить();
		
		Элементы.ЗаполнитьКПС40130.Видимость = Результат.Пустой()
		
	КонецЕсли;
		
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ТекстФинансовыйГод = Год(Объект.ФинансовыйГод);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.ЗакрываемыеСчета.Количество() > 0 Или Объект.ЗавершениеСчетов.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;

		ТекстВопроса = НСтр("ru = 'При изменении организации табличная часть будет очищена.
									|Изменить организацию?'");
									
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Изменить организацию и очистить табличную часть'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Не изменять организацию'"));
		
		ДополнительныеПараметры = Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОрганизацияОбработкаВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, 15, КодВозвратаДиалога.Да);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
	
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        Возврат;
	КонецЕсли;
	
	Объект.Организация = ДополнительныеПараметры.ВыбранноеЗначение;
    
    Если Объект.ЗакрываемыеСчета.Количество() > 0 Тогда
		Объект.ЗакрываемыеСчета.Очистить();
	КонецЕсли;
	
	Если Объект.ЗавершениеСчетов.Количество() > 0 Тогда
		Объект.ЗавершениеСчетов.Очистить();
	КонецЕсли;
	
	Модифицированность = Истина;
    
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если Объект.ЗакрываемыеСчета.Количество() > 0 Тогда
		Объект.ЗакрываемыеСчета.Очистить();
	КонецЕсли;
	Если Объект.ЗавершениеСчетов.Количество() > 0 Тогда
		Объект.ЗавершениеСчетов.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекстФинансовыйГодПриИзменении(Элемент)
	
	Если ТекстФинансовыйГод < 2000 Тогда
		ТекстФинансовыйГод = 2000;
	КонецЕсли;
	
	Если Объект.ЗакрываемыеСчета.Количество() > 0 Или Объект.ЗавершениеСчетов.Количество() > 0 Тогда
		
		Если ТекстФинансовыйГод <> ФинансовыйГодПрежняя Тогда
			
			ТекстВопроса = НСтр("ru = 'При изменении финансового года табличная часть будет очищена.
										|Изменить финансовый год?'");
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Изменить финансовый год и очистить табличную часть'"));
			Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Не изменять финансовый год'"));
			
			Ответ = Неопределено;
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ТекстФинансовыйГодПриИзмененииЗавершение", ЭтотОбъект), ТекстВопроса, Кнопки, 15, КодВозвратаДиалога.Да);
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.ФинансовыйГод = Дата(ТекстФинансовыйГод, 12, 31, 23, 59, 59);
	ФинансовыйГодПрежняя = ТекстФинансовыйГод;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстФинансовыйГодПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
	
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        ТекстФинансовыйГод = ФинансовыйГодПрежняя;
		Модифицированность = Ложь;
        Возврат;
    КонецЕсли;
    
    Объект.ЗакрываемыеСчета.Очистить();
	Объект.ЗавершениеСчетов.Очистить();
    
    Объект.ФинансовыйГод = Дата(ТекстФинансовыйГод, 12, 31, 23, 59, 59);
	
	ФинансовыйГодПрежняя = ТекстФинансовыйГод;

КонецПроцедуры

&НаКлиенте
Процедура ИзменениеТипаУчрежденияПриИзменении(Элемент)
	
	Элементы.ТекстФинансовыйГод.Видимость = НЕ Объект.ИзменениеТипаУчреждения;
	Элементы.ФинансовыйГод.Видимость = Объект.ИзменениеТипаУчреждения;
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйГодПриИзменении(Элемент)
	
	Объект.ФинансовыйГод = КонецДня(Объект.ФинансовыйГод);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗакрываемыеСчета

&НаКлиенте
Процедура ЗакрываемыеСчетаСчет40130НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ЗакрываемыеСчета.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			ТекущиеДанные.Счет40130, 
																			ТекущиеДанные.КПС40130, 
																			ТекущиеДанные.КФО), 
															Объект.Организация,
															ТекущиеДанные.ИФО,
															ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("401.30"),
															ТекущиеДанные.КФО,
															,
															Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрываемыеСчетаСчет40130ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ЗакрываемыеСчета.ТекущиеДанные;
	
	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущиеДанные.Счет);
	Если СвойстваСчета.Вид = ПредопределенноеЗначение("ВидСчета.Пассивный") Тогда
		БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
																ТекущиеДанные.КПС40130,
																,
																,
																ТекущиеДанные.КЭК40130);
	Иначе
		БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
																ТекущиеДанные.КПС40130,
																,
																ТекущиеДанные.КЭК40130,
																);
	КонецЕсли;		
															
КонецПроцедуры

&НаКлиенте
Процедура ЗакрываемыеСчетаКПС40130НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ЗакрываемыеСчета.ТекущиеДанные;

	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(	Элемент, 
													СтандартнаяОбработка, 
													ТекущиеДанные.КПС40130, 
													Объект.Организация,
													ТекущиеДанные.ИФО,
													ТекущиеДанные.КФО,
													ТекущиеДанные.Счет40130,
													Объект.ФинансовыйГод);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрываемыеСчетаКЭК40130НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ЗакрываемыеСчета.ТекущиеДанные;
	
	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущиеДанные.Счет);
	ДК = ?(СвойстваСчета.Вид = ПредопределенноеЗначение("ВидСчета.Пассивный"), "Кт", "Дт");
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент, 
								СтандартнаяОбработка,
								ТекущиеДанные.КЭК40130,
								Объект.Организация, 
								ТекущиеДанные.ИФО,
								ТекущиеДанные.КФО, 
                                ТекущиеДанные.Счет40130,
								Объект.Дата,
								ДК);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеСчетовКПС40130НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗавершениеСчетов.ТекущиеДанные;

	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(	Элемент, 
													СтандартнаяОбработка, 
													ТекущиеДанные.КПС40130, 
													Объект.Организация,
													ТекущиеДанные.ИФО,
													ТекущиеДанные.КФО,
													ТекущиеДанные.СчетФР,
													?(Объект.ИзменениеТипаУчреждения, Неопределено, Объект.ФинансовыйГод));

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеСчетовФРСубконто1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ЗавершениеСчетов.ТекущиеДанные.ФРСубконто1, Элементы.ЗавершениеСчетов.ТекущиеДанные.СчетФР, "ФРСубконто");

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеСчетовФРСубконто2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ЗавершениеСчетов.ТекущиеДанные.ФРСубконто2, Элементы.ЗавершениеСчетов.ТекущиеДанные.СчетФР, "ФРСубконто");
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеСчетовФРСубконто3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ЗавершениеСчетов.ТекущиеДанные.ФРСубконто3, Элементы.ЗавершениеСчетов.ТекущиеДанные.СчетФР, "ФРСубконто");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Заполнить(Команда)
	
	Объект.ЗакрываемыеСчета.Очистить();
	
	ЗаполнитьТаблицуЗавершенияСчетов();
	
	Элементы.ГруппаДанные.ТекущаяСтраница = Элементы.ГруппаНовая;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеСчетовЗаполнить(Команда)
	
	ЗаполнитьТаблицуЗавершенияСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКПССчета40130(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьКПССчета40130ВТаблице", ЭтотОбъект);
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(	Неопределено, 
													Истина, 
													Неопределено, 
													Объект.Организация,
													,
													,
													СчетФинРезультата,
													?(Объект.ИзменениеТипаУчреждения, Неопределено, Объект.ФинансовыйГод),
													,
													ОписаниеОповещения);

КонецПроцедуры
												
&НаКлиенте
Процедура ЗаполнитьКПССчета40130ВТаблице(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		
		Для Каждого Стр Из Объект.ЗавершениеСчетов Цикл
			
			Стр.КПС40130  = РезультатЗакрытия;
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуЗавершенияСчетов()
	
	// Инстр 191н, п. 44:
	// Получатель бюджетных средств, администратор источников финансирования дефицита бюджета, администратор 
	// доходов бюджета формирует Справку (ф. 0503110) к Балансу (ф. 0503130) на основании данных по соответствующим 
	// кодам счетов 121002000 "Расчеты с финансовым органом по поступлениям в бюджет", 030404000 "Внутриведомственные расчеты", 
	// 030406000 "Расчеты с прочими кредиторами", 130405000 "Расчеты по платежам из бюджета с финансовым органом" и по 
	// соответствующим номерам счетов 040110000 "Доходы текущего финансового года", 040120000 "Расходы текущего финансового года" 
	// в сумме показателей, сформированных по состоянию на 1 января года, следующего за отчетным, в рамках бюджетной деятельности 
	// (раздел 1), до проведения заключительных операций (графы 2, 3) и в сумме заключительных операций по закрытию счетов, 
	// произведенных 31 декабря, по завершении отчетного финансового года (графы 4 - 9).
	//
	// Кредитовые показатели по коду счета 121002000 "Расчеты с финансовым органом по поступлениям в бюджет", сформированные по 
	// состоянию на 1 января года, следующего за отчетным, отражаются в графе 2 Справки (ф. 0503110) со знаком "минус".
	//
	// Т.о. вид счета (активный) учитывается только для счета 121002. Для остальных остатки считаются как для активно-пассивных счетов
	
	// Уточнения от 31.01.2019
	// Счет 040130000 "Финансовый результат прошлых отчетных периодов" 
	// 122. Операции при заключении счетов текущего финансового года учреждений отражаются: 
	// по дебету счета 040130000 "Финансовый результат прошлых отчетных периодов" в корреспонденции с кредитом соответствующих 
	// счетов аналитического учета счетов 021002000 "Расчеты с финансовым органом по поступлениям в бюджет", 030404000 "Внутриведомственные расчеты";
	// (в ред. Приказов Минфина России от 24.12.2012 N 174н, от 17.08.2015 N 127н)
	// по кредиту счета 040130000 "Финансовый результат прошлых отчетных периодов" в корреспонденции с дебетом соответствующих 
	// счетов аналитического учета счетов 030405000 "Расчеты по платежам из бюджета с финансовым органом", 030404000 "Внутриведомственные расчеты";
	// (в ред. Приказов Минфина России от 24.12.2012 N 174н, от 17.08.2015 N 127н)
	// суммы уценки (дооценки) стоимости объекта основных средств и начисленной амортизации, полученные в результате переоценки, 
	// отражаются по дебету (кредиту) счета 040130000 "Финансовый результат прошлых отчетных периодов" и кредиту (дебету) соответствующих 
	// счетов аналитического учета счетов 010100000 "Основные средства", 010400000 "Амортизация";
	// заключение счетов текущего финансового года отражается по кредиту (дебету) счета 040130000 "Финансовый результат прошлых отчетных периодов" 
	// и дебету (кредиту) соответствующих счетов аналитического учета счета 040110100 "Доходы экономического субъекта";
	// (в ред. Приказа Минфина России от 17.08.2015 N 127н)
	// заключение счетов текущего финансового года отражается по кредиту (дебету) соответствующих счетов аналитического учета счета 040120200 "Расходы 
	// экономического субъекта" и дебету (кредиту) счета 040130000 "Финансовый результат прошлых отчетных периодов". 
	// (в ред. Приказа Минфина России от 17.08.2015
	//
	// МИНИСТЕРСТВО ФИНАНСОВ РОССИЙСКОЙ ФЕДЕРАЦИИ 
	//
	// ПИСЬМО 
	// от 28 ноября 2014 г. N 02-07-10/61077 
	//
	// Департамент бюджетной методологии Министерства финансов Российской Федерации (далее - Департамент) рассмотрел письмо по вопросу отражения 
	// показателей в Справке по заключению счетов бюджетного учета отчетного финансового года (ф. 0503110) (далее - Справка ф. 0503110) и сообщает.
	// В силу положений постановления Правительства Российской Федерации от 30 июня 2004 г. N 329 "О Министерстве финансов Российской Федерации" 
	// в Министерстве финансов Российской Федерации не рассматриваются по существу обращения по оценке конкретных хозяйственных ситуаций.
	// Вместе с тем Департамент считает необходимым отметить следующее. 
	// Порядок составления и представления годовой, квартальной и месячной отчетности об исполнении бюджетов бюджетной системы Российской Федерации, 
	// а также Инструкция по его применению утверждены приказом Министерства финансов Российской Федерации от 28.12.2010 N 191н (далее - Инструкция 191н).
	// Пунктом 44 Инструкции 191н предусмотрено, что получатель бюджетных средств, администратор источников финансирования дефицита бюджета, 
	// администратор доходов бюджета формирует Справку (ф. 0503110) к Балансу (ф. 0503130) на основании данных по соответствующим кодам 
	// счетов 121002000 "Расчеты с финансовым органом по поступлениям в бюджет", 030404000 "Внутриведомственные расчеты", 030406000 "Расчеты с 
	// прочими кредиторами", 130405000 "Расчеты по платежам из бюджета с финансовым органом" и по соответствующим номерам счетов 040110000 "Доходы 
	// текущего финансового года", 040120000 "Расходы текущего финансового года" в сумме показателей, сформированных по состоянию на 1 января года, 
	// следующего за отчетным, в рамках бюджетной деятельности (раздел 1), до проведения заключительных операций (графы 2, 3) и в сумме заключительных 
	// операций по закрытию счетов, произведенных 31 декабря, по завершении отчетного финансового года (графы 4 - 9).
	// Согласно положениям пункта 122 Инструкции по применению счетов бюджетного учета, утвержденной приказом Министерства финансов Российской Федерации 
	// от 06.12.2010 N 162н, заключение счетов текущего финансового года экономического субъекта 040120000 "Расходы текущего финансового года" отражается 
	// в корреспонденции со счетом 040130000 "Финансовый результат прошлых отчетных периодов" в части дебетовых и кредитовых остатков.
	// С учетом изложенного отражение развернутого сальдо по счетам финансового результата положениями Инструкции 162н не предусмотрено.
	// Таким образом, по мнению Департамента, в форме отчетности Справка ф. 0503110 подлежит отражению показатель заключения счетов части дебетового 
	// или кредитового остатка, сформированного на счете на конец отчетного периода.
	//
	// Заместитель директора 
	// Департамента бюджетной методологии 
	// С.В.СИВЕЦ 
	// 28.11.2014 
	//
	// Т.о. счет 304.05 также сворачиваем, и закрываем как пассивный 
	
	// Порядок закрытия 401.10, 401.20 определяем в целом по счету, без аналитики, по сложившемуся остатку - дебет или кредит.
	// По аналитике остатки не разворачиваем.
	
	// Для счета 304.04 надо при передаче ОС отдельно закрывать остатки по стоимости бъекта и переданной амортизации.
	// Выделить такую информацию из остатков нельзя, КБК и КОСГУ одинаковые.
	// Для счета 304.04 по КОСГУ 310 для закрытия берем обороты.	
	
	// 20.01.2022 HL-438314
	// По счету 304.04 в отчете за 2021 казначейство делает проверку развернуто по ф. 0503125 и 0503110   
	
	// 12.12.2023
	// Проект письма по отчетности за 2023 год - 304.06 закрывается по оборотам, так же, как и 304.04
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	МассивВыбранных = Новый Массив;
	
	Для Каждого ВыбранныйКод Из СписокСчетов Цикл
		Если ВыбранныйКод.Пометка Тогда
			МассивВыбранных.Добавить(ВыбранныйКод.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Объект.ЗавершениеСчетов.Очистить();
	
	Если МассивВыбранных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	                                               
	Объект.СписокКодовСчетов = СтрСоединить(МассивВыбранных, ",");
	
	СчетаЗакрытия = БухгалтерскийУчет.СписокСчетов(Объект.СписокКодовСчетов);
	
	Счета30404 = Новый Массив;
	
	Индекс30404 = МассивВыбранных.Найти("304.04");
	
	Если НЕ Индекс30404 = Неопределено Тогда
		Счета30404 = БухгалтерскийУчет.СписокСчетов("304.04");
	КонецЕсли;
	
	Счета30406 = Новый Массив;
	
	Индекс30406 = МассивВыбранных.Найти("304.06");
	
	Если НЕ Индекс30406 = Неопределено Тогда
		Счета30406 = БухгалтерскийУчет.СписокСчетов("304.06");
	КонецЕсли;
	
	Счета40110 = Новый Массив;
	
	Индекс40110 = МассивВыбранных.Найти("401.10");
	
	Если НЕ Индекс40110 = Неопределено Тогда
		Счета40110 = БухгалтерскийУчет.СписокСчетов("401.10");
	КонецЕсли;
	
	Счета40120 = Новый Массив;
	
	Индекс40120 = МассивВыбранных.Найти("401.20");
	
	Если НЕ Индекс40120 = Неопределено Тогда
		Счета40120 = БухгалтерскийУчет.СписокСчетов("401.20");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
	|	ЖурналПроводокЕПСБУОстатки.КЭК КАК КЭК,
	|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПС,
	|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЖурналПроводокЕПСБУОстатки.Счет.Код, 1, 1) = ""2""
	|				ИЛИ ПОДСТРОКА(ЖурналПроводокЕПСБУОстатки.Счет.Код, 1, 6) = ""304.05""
	|			ТОГДА ""Дт""
	|		КОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт > 0
	|			ТОГДА ""Дт""
	|		КОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт < 0
	|			ТОГДА ""Дт""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПорядокДт,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЖурналПроводокЕПСБУОстатки.Счет.Код, 1, 1) = ""2""
	|				ИЛИ ПОДСТРОКА(ЖурналПроводокЕПСБУОстатки.Счет.Код, 1, 6) = ""304.05""
	|			ТОГДА ""Кт""
	|		КОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт > 0
	|			ТОГДА ""Кт""
	|		КОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт < 0
	|			ТОГДА ""Кт""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПорядокКт
	|ПОМЕСТИТЬ ПорядокДтКт
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет В (&СчетаЗакрытия), , Организация = &Организация) КАК ЖурналПроводокЕПСБУОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
	|	ЖурналПроводокЕПСБУОстатки.КЭК КАК КЭК,
	|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПС,
	|	ЖурналПроводокЕПСБУОстатки.ИФО КАК ИФО,
	|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУОстатки.Подразделение КАК Подразделение,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК Субконто1,
	|	ЖурналПроводокЕПСБУОстатки.Субконто2 КАК Субконто2,
	|	ЖурналПроводокЕПСБУОстатки.Субконто3 КАК Субконто3,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЖурналПроводокЕПСБУОстатки.Счет.Код, 1, 1) = ""2""
	|				ИЛИ ПОДСТРОКА(ЖурналПроводокЕПСБУОстатки.Счет.Код, 1, 6) = ""304.05""
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт = 0
	|				И ПорядокДтКт.ПорядокДт = ""Дт""
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт = 0
	|				И ПорядокДтКт.ПорядокДт = ""Дт""
	|			ТОГДА -ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|		КОГДА ПорядокДтКт.ПорядокДт ЕСТЬ NULL
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокДебет,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЖурналПроводокЕПСБУОстатки.Счет.Код, 1, 1) = ""2""
	|				ИЛИ ПОДСТРОКА(ЖурналПроводокЕПСБУОстатки.Счет.Код, 1, 6) = ""304.05""
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт = 0
	|				И ПорядокДтКт.ПорядокКт = ""Кт""
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт = 0
	|				И ПорядокДтКт.ПорядокКт = ""Кт""
	|			ТОГДА -ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт
	|		КОГДА ПорядокДтКт.ПорядокКт ЕСТЬ NULL
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокКредит
	|ПОМЕСТИТЬ ОстаткиДтКт
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&СчетаЗакрытия)
	|				И НЕ Счет В (&Счета30404)
	|				И НЕ Счет В (&Счета30406)
	|				И НЕ Счет В (&Счета40110)
	|				И НЕ Счет В (&Счета40120),
	|			,
	|			Организация = &Организация) КАК ЖурналПроводокЕПСБУОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПорядокДтКт.Счет КАК Счет,
	|			ПорядокДтКт.КЭК КАК КЭК,
	|			ПорядокДтКт.КПС КАК КПС,
	|			ПорядокДтКт.КФО КАК КФО,
	|			ПорядокДтКт.ПорядокДт КАК ПорядокДт,
	|			ПорядокДтКт.ПорядокКт КАК ПорядокКт
	|		ИЗ
	|			ПорядокДтКт КАК ПорядокДтКт) КАК ПорядокДтКт
	|		ПО ЖурналПроводокЕПСБУОстатки.Счет = ПорядокДтКт.Счет
	|			И ЖурналПроводокЕПСБУОстатки.КПС = ПорядокДтКт.КПС
	|			И ЖурналПроводокЕПСБУОстатки.КЭК = ПорядокДтКт.КЭК
	|			И ЖурналПроводокЕПСБУОстатки.КФО = ПорядокДтКт.КФО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	| // счета 304.04, 304.06
	|
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Счет,
	|	ЖурналПроводокЕПСБУОстатки.КЭК,
	|	ЖурналПроводокЕПСБУОстатки.КПС,
	|	ЖурналПроводокЕПСБУОстатки.ИФО,
	|	ЖурналПроводокЕПСБУОстатки.КФО,
	|	ЖурналПроводокЕПСБУОстатки.Подразделение,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1,
	|	ЖурналПроводокЕПСБУОстатки.Субконто2,
	|	ЖурналПроводокЕПСБУОстатки.Субконто3,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт = 0
	|				И ПорядокДтКт.ПорядокДт = ""Дт""
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт = 0
	|				И ПорядокДтКт.ПорядокДт = ""Дт""
	|			ТОГДА -ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|		КОГДА ПорядокДтКт.ПорядокДт ЕСТЬ NULL
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт = 0
	|				И ПорядокДтКт.ПорядокКт = ""Кт""
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт = 0
	|				И ПорядокДтКт.ПорядокКт = ""Кт""
	|			ТОГДА -ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт
	|		КОГДА ПорядокДтКт.ПорядокКт ЕСТЬ NULL
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&Счета30404)
	|			ИЛИ Счет В (&Счета30406),
	|			,
	|			Организация = &Организация
	|				И (НЕ КЭК.Код = ""310"" И НЕ &Счета30404Развернуто) ) КАК ЖурналПроводокЕПСБУОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПорядокДтКт.Счет КАК Счет,
	|			ПорядокДтКт.КЭК КАК КЭК,
	|			ПорядокДтКт.КПС КАК КПС,
	|			ПорядокДтКт.КФО КАК КФО,
	|			ПорядокДтКт.ПорядокДт КАК ПорядокДт,
	|			ПорядокДтКт.ПорядокКт КАК ПорядокКт
	|		ИЗ
	|			ПорядокДтКт КАК ПорядокДтКт) КАК ПорядокДтКт
	|		ПО ЖурналПроводокЕПСБУОстатки.Счет = ПорядокДтКт.Счет
	|			И ЖурналПроводокЕПСБУОстатки.КПС = ПорядокДтКт.КПС
	|			И ЖурналПроводокЕПСБУОстатки.КЭК = ПорядокДтКт.КЭК
	|			И ЖурналПроводокЕПСБУОстатки.КФО = ПорядокДтКт.КФО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОборотыДтКт.СчетКт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КЭККт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КПСКт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.ИФО,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КФО,
	|	ЖурналПроводокЕПСБУОборотыДтКт.ПодразделениеКт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт1,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт2,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт3,
	|	0,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			&НачГода,
	|			&Период,
	|			Период,
	|			,
	|			,
	|			СчетКт В (&Счета30404) ИЛИ СчетКт В (&Счета30406),
	|			,
	|			Организация = &Организация
	|				И (КЭККт.Код = ""310"" ИЛИ &Счета30404Развернуто)) КАК ЖурналПроводокЕПСБУОборотыДтКт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОборотыДтКт.СчетДт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КЭКДт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КПСДт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.ИФО,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КФО,
	|	ЖурналПроводокЕПСБУОборотыДтКт.ПодразделениеДт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт1,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт2,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт3,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СуммаОборот,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			&НачГода,
	|			&Период,
	|			Период,
	|			СчетДт В (&Счета30404) ИЛИ СчетДт В (&Счета30406),
	|			,
	|			,
	|			,
	|			Организация = &Организация
	|				И (КЭКДт.Код = ""310"" ИЛИ &Счета30404Развернуто)) КАК ЖурналПроводокЕПСБУОборотыДтКт  
	|ОБЪЕДИНИТЬ ВСЕ
	| // счета 401.10
	|
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Счет,
	|	ЖурналПроводокЕПСБУОстатки.КЭК,
	|	ЖурналПроводокЕПСБУОстатки.КПС,
	|	ЖурналПроводокЕПСБУОстатки.ИФО,
	|	ЖурналПроводокЕПСБУОстатки.КФО,
	|	ЖурналПроводокЕПСБУОстатки.Подразделение,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1,
	|	ЖурналПроводокЕПСБУОстатки.Субконто2,
	|	ЖурналПроводокЕПСБУОстатки.Субконто3,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт = 0
	|				И ПорядокДтКт.ПорядокДт = ""Дт""
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт = 0
	|				И ПорядокДтКт.ПорядокДт = ""Дт""
	|			ТОГДА -ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|		КОГДА ПорядокДтКт.ПорядокДт ЕСТЬ NULL
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт = 0
	|				И ПорядокДтКт.ПорядокКт = ""Кт""
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт = 0
	|				И ПорядокДтКт.ПорядокКт = ""Кт""
	|			ТОГДА -ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт
	|		КОГДА ПорядокДтКт.ПорядокКт ЕСТЬ NULL
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&Счета40110),
	|			,
	|			Организация = &Организация
	|				И (НЕ &Счета40110Развернуто) ) КАК ЖурналПроводокЕПСБУОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПорядокДтКт.Счет КАК Счет,
	|			ПорядокДтКт.КЭК КАК КЭК,
	|			ПорядокДтКт.КПС КАК КПС,
	|			ПорядокДтКт.КФО КАК КФО,
	|			ПорядокДтКт.ПорядокДт КАК ПорядокДт,
	|			ПорядокДтКт.ПорядокКт КАК ПорядокКт
	|		ИЗ
	|			ПорядокДтКт КАК ПорядокДтКт) КАК ПорядокДтКт
	|		ПО ЖурналПроводокЕПСБУОстатки.Счет = ПорядокДтКт.Счет
	|			И ЖурналПроводокЕПСБУОстатки.КПС = ПорядокДтКт.КПС
	|			И ЖурналПроводокЕПСБУОстатки.КЭК = ПорядокДтКт.КЭК
	|			И ЖурналПроводокЕПСБУОстатки.КФО = ПорядокДтКт.КФО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОборотыДтКт.СчетКт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КЭККт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КПСКт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.ИФО,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КФО,
	|	ЖурналПроводокЕПСБУОборотыДтКт.ПодразделениеКт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт1,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт2,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт3,
	|	0,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			&НачГода,
	|			&Период,
	|			Период,
	|			,
	|			,
	|			СчетКт В (&Счета40110),
	|			,
	|			Организация = &Организация
	|				И (&Счета40110Развернуто)) КАК ЖурналПроводокЕПСБУОборотыДтКт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОборотыДтКт.СчетДт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КЭКДт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КПСДт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.ИФО,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КФО,
	|	ЖурналПроводокЕПСБУОборотыДтКт.ПодразделениеДт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт1,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт2,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт3,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СуммаОборот,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			&НачГода,
	|			&Период,
	|			Период,
	|			СчетДт В (&Счета40110),
	|			,
	|			,
	|			,
	|			Организация = &Организация
	|				И (&Счета40110Развернуто)) КАК ЖурналПроводокЕПСБУОборотыДтКт  
    |ОБЪЕДИНИТЬ ВСЕ
	| // счета 401.20
	|
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Счет,
	|	ЖурналПроводокЕПСБУОстатки.КЭК,
	|	ЖурналПроводокЕПСБУОстатки.КПС,
	|	ЖурналПроводокЕПСБУОстатки.ИФО,
	|	ЖурналПроводокЕПСБУОстатки.КФО,
	|	ЖурналПроводокЕПСБУОстатки.Подразделение,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1,
	|	ЖурналПроводокЕПСБУОстатки.Субконто2,
	|	ЖурналПроводокЕПСБУОстатки.Субконто3,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт = 0
	|				И ПорядокДтКт.ПорядокДт = ""Дт""
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт = 0
	|				И ПорядокДтКт.ПорядокДт = ""Дт""
	|			ТОГДА -ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|		КОГДА ПорядокДтКт.ПорядокДт ЕСТЬ NULL
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт = 0
	|				И ПорядокДтКт.ПорядокКт = ""Кт""
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|		КОГДА НЕ ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт = 0
	|				И ПорядокДтКт.ПорядокКт = ""Кт""
	|			ТОГДА -ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт
	|		КОГДА ПорядокДтКт.ПорядокКт ЕСТЬ NULL
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&Счета40120),
	|			,
	|			Организация = &Организация
	|				И (НЕ &Счета40120Развернуто) ) КАК ЖурналПроводокЕПСБУОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПорядокДтКт.Счет КАК Счет,
	|			ПорядокДтКт.КЭК КАК КЭК,
	|			ПорядокДтКт.КПС КАК КПС,
	|			ПорядокДтКт.КФО КАК КФО,
	|			ПорядокДтКт.ПорядокДт КАК ПорядокДт,
	|			ПорядокДтКт.ПорядокКт КАК ПорядокКт
	|		ИЗ
	|			ПорядокДтКт КАК ПорядокДтКт) КАК ПорядокДтКт
	|		ПО ЖурналПроводокЕПСБУОстатки.Счет = ПорядокДтКт.Счет
	|			И ЖурналПроводокЕПСБУОстатки.КПС = ПорядокДтКт.КПС
	|			И ЖурналПроводокЕПСБУОстатки.КЭК = ПорядокДтКт.КЭК
	|			И ЖурналПроводокЕПСБУОстатки.КФО = ПорядокДтКт.КФО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОборотыДтКт.СчетКт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КЭККт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КПСКт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.ИФО,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КФО,
	|	ЖурналПроводокЕПСБУОборотыДтКт.ПодразделениеКт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт1,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт2,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт3,
	|	0,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			&НачГода,
	|			&Период,
	|			Период,
	|			,
	|			,
	|			СчетКт В (&Счета40120),
	|			,
	|			Организация = &Организация
	|				И (&Счета40120Развернуто)) КАК ЖурналПроводокЕПСБУОборотыДтКт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОборотыДтКт.СчетДт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КЭКДт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КПСДт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.ИФО,
	|	ЖурналПроводокЕПСБУОборотыДтКт.КФО,
	|	ЖурналПроводокЕПСБУОборотыДтКт.ПодразделениеДт,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт1,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт2,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт3,
	|	ЖурналПроводокЕПСБУОборотыДтКт.СуммаОборот,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			&НачГода,
	|			&Период,
	|			Период,
	|			СчетДт В (&Счета40120),
	|			,
	|			,
	|			,
	|			Организация = &Организация
	|				И (&Счета40120Развернуто)) КАК ЖурналПроводокЕПСБУОборотыДтКт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДтКт.Счет КАК Счет,
	|	ОстаткиДтКт.КЭК КАК КЭК,
	|	ОстаткиДтКт.КПС КАК КПС,
	|	ОстаткиДтКт.ИФО КАК ИФО,
	|	ОстаткиДтКт.КФО КАК КФО,
	|	ОстаткиДтКт.Подразделение КАК Подразделение,
	|	ОстаткиДтКт.Субконто1 КАК Субконто1,
	|	ОстаткиДтКт.Субконто2 КАК Субконто2,
	|	ОстаткиДтКт.Субконто3 КАК Субконто3,
	|	ОстаткиДтКт.ОстатокДебет КАК ОстатокДебет,
	|	ОстаткиДтКт.ОстатокКредит КАК ОстатокКредит,
	|	&СчетФинРезультата КАК СчетФР,
	|	ВЫБОР
	|		КОГДА ФРВидСубконто1.ВидСубконто = ВидСубконто1.ВидСубконто
	|			ТОГДА ОстаткиДтКт.Субконто1
	|		КОГДА ФРВидСубконто1.ВидСубконто = ВидСубконто2.ВидСубконто
	|			ТОГДА ОстаткиДтКт.Субконто2
	|		КОГДА ФРВидСубконто1.ВидСубконто = ВидСубконто3.ВидСубконто
	|			ТОГДА ОстаткиДтКт.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ФРСубконто1,
	|	ВЫБОР
	|		КОГДА ФРВидСубконто2.ВидСубконто = ВидСубконто1.ВидСубконто
	|			ТОГДА ОстаткиДтКт.Субконто1
	|		КОГДА ФРВидСубконто2.ВидСубконто = ВидСубконто2.ВидСубконто
	|			ТОГДА ОстаткиДтКт.Субконто2
	|		КОГДА ФРВидСубконто2.ВидСубконто = ВидСубконто3.ВидСубконто
	|			ТОГДА ОстаткиДтКт.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ФРСубконто2,
	|	ВЫБОР
	|		КОГДА ФРВидСубконто3.ВидСубконто = ВидСубконто1.ВидСубконто
	|			ТОГДА ОстаткиДтКт.Субконто1
	|		КОГДА ФРВидСубконто3.ВидСубконто = ВидСубконто2.ВидСубконто
	|			ТОГДА ОстаткиДтКт.Субконто2
	|		КОГДА ФРВидСубконто3.ВидСубконто = ВидСубконто3.ВидСубконто
	|			ТОГДА ОстаткиДтКт.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ФРСубконто3
	|ИЗ
	|	ОстаткиДтКт КАК ОстаткиДтКт
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЕПСБУВидыСубконто.ВидСубконто КАК ВидСубконто,
	|			ЕПСБУВидыСубконто.Ссылка КАК Ссылка
	|		ИЗ
	|			ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ГДЕ
	|			ЕПСБУВидыСубконто.НомерСтроки = 1) КАК ВидСубконто1
	|		ПО ОстаткиДтКт.Счет = ВидСубконто1.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЕПСБУВидыСубконто.ВидСубконто КАК ВидСубконто,
	|			ЕПСБУВидыСубконто.Ссылка КАК Ссылка
	|		ИЗ
	|			ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ГДЕ
	|			ЕПСБУВидыСубконто.НомерСтроки = 2) КАК ВидСубконто2
	|		ПО ОстаткиДтКт.Счет = ВидСубконто2.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЕПСБУВидыСубконто.ВидСубконто КАК ВидСубконто,
	|			ЕПСБУВидыСубконто.Ссылка КАК Ссылка
	|		ИЗ
	|			ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ГДЕ
	|			ЕПСБУВидыСубконто.НомерСтроки = 3) КАК ВидСубконто3
	|		ПО ОстаткиДтКт.Счет = ВидСубконто3.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЕПСБУВидыСубконто.ВидСубконто КАК ВидСубконто,
	|			ЕПСБУВидыСубконто.Ссылка КАК Ссылка
	|		ИЗ
	|			ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ГДЕ
	|			ЕПСБУВидыСубконто.НомерСтроки = 1) КАК ФРВидСубконто1
	|		ПО (&СчетФинРезультата = ФРВидСубконто1.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЕПСБУВидыСубконто.ВидСубконто КАК ВидСубконто,
	|			ЕПСБУВидыСубконто.Ссылка КАК Ссылка
	|		ИЗ
	|			ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ГДЕ
	|			ЕПСБУВидыСубконто.НомерСтроки = 2) КАК ФРВидСубконто2
	|		ПО (&СчетФинРезультата = ФРВидСубконто2.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЕПСБУВидыСубконто.ВидСубконто КАК ВидСубконто,
	|			ЕПСБУВидыСубконто.Ссылка КАК Ссылка
	|		ИЗ
	|			ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ГДЕ
	|			ЕПСБУВидыСубконто.НомерСтроки = 3) КАК ФРВидСубконто3
	|		ПО (&СчетФинРезультата = ФРВидСубконто3.Ссылка)
	|ГДЕ
	|	(НЕ ОстаткиДтКт.ОстатокДебет = 0
	|			ИЛИ НЕ ОстаткиДтКт.ОстатокКредит = 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиДтКт.Счет.Порядок,
	|	ИФО,
	|	КФО,
	|	КПС,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3
	|АВТОУПОРЯДОЧИВАНИЕ";
				   
	Запрос.УстановитьПараметр("Период", 				Новый Граница(Объект.ФинансовыйГод, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачГода",            	Новый Граница(НачалоГода(Объект.ФинансовыйГод), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", 			Объект.Организация);
	Запрос.УстановитьПараметр("СчетаЗакрытия",			СчетаЗакрытия);
	Запрос.УстановитьПараметр("Счета30404",				Счета30404);
	Запрос.УстановитьПараметр("Счета30406",				Счета30406);
	Запрос.УстановитьПараметр("СчетФинРезультата",		СчетФинРезультата);
	Запрос.УстановитьПараметр("Счета30404Развернуто",	ИСТИНА);
    Запрос.УстановитьПараметр("Счета40110",				Счета40110); 
	Запрос.УстановитьПараметр("Счета40120",				Счета40120);
	
	Если Год(Объект.ФинансовыйГод) < 2022 Тогда
		Запрос.УстановитьПараметр("Счета40110Развернуто",	ЛОЖЬ);
		Запрос.УстановитьПараметр("Счета40120Развернуто",	ЛОЖЬ);
	Иначе
		Запрос.УстановитьПараметр("Счета40110Развернуто",	ИСТИНА);
		Запрос.УстановитьПараметр("Счета40120Развернуто",	ИСТИНА);
	КонецЕсли;

	Объект.ЗавершениеСчетов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для Каждого Стр Из Объект.ЗавершениеСчетов Цикл
		
		Стр.КПС40130  = БухгалтерскиеОперацииПовтИсп.КПССчета(Объект.Организация, Стр.ИФО, Стр.КФО, Объект.ФинансовыйГод, Стр.СчетФР);
		 		
	КонецЦикла;	
	
	Объект.ВидМежотчетногоПериода = ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ЗаключениеСчетов");
		
	Модифицированность = Истина;
	
КонецПроцедуры	


#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
